; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=2, waypoints=6, cameras=2, objectives=4, out_folder=training/easy, instance_id=43, seed=78

(define (problem rover-43)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 - rover
    rover1store rover2store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 - waypoint
    camera1 camera2 - camera
    objective1 objective2 objective3 objective4 - objective)
 (:init 
    (at_lander general waypoint2)
    (at rover1 waypoint1)
    (at rover2 waypoint3)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover2)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover2)
    (empty rover1store)
    (empty rover2store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (visible waypoint6 waypoint2)
    (visible waypoint6 waypoint5)
    (visible waypoint3 waypoint1)
    (visible waypoint6 waypoint1)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint2 waypoint6)
    (visible waypoint5 waypoint6)
    (visible waypoint1 waypoint6)
    (visible waypoint1 waypoint3)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint2 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint3 waypoint6)
    (can_traverse rover1 waypoint6 waypoint3)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint1 waypoint4)
    (can_traverse rover2 waypoint4 waypoint1)
    (can_traverse rover2 waypoint1 waypoint5)
    (can_traverse rover2 waypoint5 waypoint1)
    (calibration_target camera1 objective1)
    (on_board camera1 rover2)
    (supports camera1 low_res)
    (calibration_target camera2 objective1)
    (on_board camera2 rover2)
    (supports camera2 colour)
    (supports camera2 high_res)
    (supports camera1 high_res)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint5)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint5)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint2)
    (visible_from objective3 waypoint6)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint2)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint5))
 (:goal  (and 
    (communicated_rock_data waypoint4)
    (communicated_rock_data waypoint3)
    
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective2 colour))))

; plan
1. (calibrate rover2 camera1 objective1 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 0 of 8
2. (calibrate rover2 camera2 objective1 waypoint3)
   added: (calibrated camera2 rover2)
   goals met: 0 of 8
3. (take_image rover2 waypoint3 objective4 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective4 low_res)
   goals met: 0 of 8
4. (communicate_image_data rover2 general objective4 low_res waypoint3 waypoint2)
   added: (communicated_image_data objective4 low_res)
   goals met: 1 of 8
5. (take_image rover2 waypoint3 objective2 camera2 colour)
   deleted: (calibrated camera2 rover2)
   added: (have_image rover2 objective2 colour)
   goals met: 1 of 8
6. (communicate_image_data rover2 general objective2 colour waypoint3 waypoint2)
   added: (communicated_image_data objective2 colour)
   goals met: 2 of 8
7. (calibrate rover2 camera1 objective1 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 2 of 8
8. (take_image rover2 waypoint3 objective2 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective2 high_res)
   goals met: 2 of 8
9. (communicate_image_data rover2 general objective2 high_res waypoint3 waypoint2)
   added: (communicated_image_data objective2 high_res)
   goals met: 3 of 8
10. (calibrate rover2 camera1 objective1 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 3 of 8
11. (take_image rover2 waypoint3 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective2 low_res)
   goals met: 3 of 8
12. (communicate_image_data rover2 general objective2 low_res waypoint3 waypoint2)
   added: (communicated_image_data objective2 low_res)
   goals met: 4 of 8
13. (calibrate rover2 camera1 objective1 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 4 of 8
14. (take_image rover2 waypoint3 objective3 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective3 high_res)
   goals met: 4 of 8
15. (communicate_image_data rover2 general objective3 high_res waypoint3 waypoint2)
   added: (communicated_image_data objective3 high_res)
   goals met: 5 of 8
16. (calibrate rover2 camera1 objective1 waypoint3)
   added: (calibrated camera1 rover2)
   goals met: 5 of 8
17. (take_image rover2 waypoint3 objective4 camera1 high_res)
   deleted: (calibrated camera1 rover2)
   added: (have_image rover2 objective4 high_res)
   goals met: 5 of 8
18. (communicate_image_data rover2 general objective4 high_res waypoint3 waypoint2)
   added: (communicated_image_data objective4 high_res)
   goals met: 6 of 8
19. (sample_rock rover2 rover2store waypoint3)
   deleted: (empty rover2store) (at_rock_sample waypoint3)
   added: (full rover2store) (have_rock_analysis rover2 waypoint3)
   goals met: 6 of 8
20. (navigate rover2 waypoint3 waypoint1)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint1)
   goals met: 6 of 8
21. (navigate rover2 waypoint1 waypoint4)
   deleted: (at rover2 waypoint1)
   added: (at rover2 waypoint4)
   goals met: 6 of 8
22. (communicate_rock_data rover2 general waypoint3 waypoint4 waypoint2)
   added: (communicated_rock_data waypoint3)
   goals met: 7 of 8
23. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 7 of 8
24. (sample_rock rover2 rover2store waypoint4)
   deleted: (empty rover2store) (at_rock_sample waypoint4)
   added: (full rover2store) (have_rock_analysis rover2 waypoint4)
   goals met: 7 of 8
25. (communicate_rock_data rover2 general waypoint4 waypoint4 waypoint2)
   added: (communicated_rock_data waypoint4)
   goals met: 8 of 8
